src/Catalogs/уатУчетныеЗаписиПЦ/уатУчетныеЗаписиПЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатУчетныеЗаписиПЦ</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВнешняяСистема</name>
    <comment>Внешняя система (уат)</comment>
    <type>
      <types>CatalogRef.уатВнешниеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервиса</name>
    <comment>Адрес сервиса (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <comment>Логин (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючАвторизации</name>
    <comment>Ключ авторизации (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьЗаправкиГСМ</name>
    <comment>Создавать заправки ГСМ (уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IDКонтракта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДоговора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СохранятьОтчетВКаталог</name>
    <comment>(уат)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогФайлаДанных</name>
    <comment>(уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоОбмена</name>
    <comment>(УАТ)</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазбиватьНаОтделы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SSLСертификат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяАЗС</name>
    <type>
      <types>CatalogRef.уатАЗС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогированиеЗапросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <comment>Пароль (уат)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/уатВнешниеСистемы/уатВнешниеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатВнешниеСистемы</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>_1СЦСМ</name>
      <description>1С:Центр спутникового мониторинга</description>
    </items>
    <items>
      <name>MultiGo</name>
      <description>MultiGo</description>
    </items>
    <items>
      <name>Omnicomm</name>
      <description>Omnicomm</description>
    </items>
    <items>
      <name>Wialon</name>
      <description>Wialon</description>
    </items>
    <items>
      <name>АвтоГРАФ</name>
      <description>АвтоГРАФ</description>
    </items>
    <items>
      <name>Автодор</name>
      <description>Автодор</description>
    </items>
    <items>
      <name>Газпромнефть</name>
      <description>Газпромнефть</description>
    </items>
    <items>
      <name>ЛукойлЛИКАРД</name>
      <description>Лукойл ЛИКАРД</description>
    </items>
    <items>
      <name>Паркоматика</name>
      <description>Паркоматика</description>
    </items>
    <items>
      <name>Платон</name>
      <description>Платон</description>
    </items>
    <items>
      <name>ППР</name>
      <description>ППР</description>
    </items>
    <items>
      <name>СКАУТ</name>
      <description>СКАУТ</description>
    </items>
    <items>
      <name>Роснефть</name>
      <description>Топливные карты Роснефть</description>
    </items>
    <items>
      <name>ШтрафовНет</name>
      <description>Штрафов НЕТ</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипВнешнейСистемы</name>
    <type>
      <types>EnumRef.уатТипыВнешнихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПС</name>
    <comment>(уат)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/уатУчетныеЗаписиПЦ/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если СохранятьОтчетВКаталог тогда
		ПроверяемыеРеквизиты.Добавить("КаталогФайлаДанных");
	КонецЕсли;
	
	Если ВнешняяСистема = Справочники.уатВнешниеСистемы.Газпромнефть Тогда
		ПроверяемыеРеквизиты.Добавить("КлючАвторизации");
		ПроверяемыеРеквизиты.Добавить("Пароль");
	ИначеЕсли ВнешняяСистема = Справочники.уатВнешниеСистемы.ППР Тогда
		ПроверяемыеРеквизиты.Добавить("КлючАвторизации");
	ИначеЕсли ВнешняяСистема = Справочники.уатВнешниеСистемы.ЛукойлЛИКАРД Тогда
		Если ЗначениеЗаполнено(SSLСертификат.Получить()) Тогда
			ПроверяемыеРеквизиты.Добавить("Пароль");
			ПроверяемыеРеквизиты.Добавить("IDКонтракта");
		КонецЕсли;
	ИначеЕсли ВнешняяСистема = Справочники.уатВнешниеСистемы.Роснефть Тогда
		ПроверяемыеРеквизиты.Добавить("Пароль");
		ПроверяемыеРеквизиты.Добавить("IDКонтракта");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
